{
  "recetas": [
    {
      "nombreReceta": "Empanada Tucumana",
      "imagen": "https://www.lanacion.com.ar/resizer/co_33nH7YoDnZrJrks1_0EqgGvQ=/309x206/filters:format(webp):quality(80)/cloudfront-us-east-1.images.arcpublishing.com/lanacionar/ZEMLUTI4JVFPZIMJM4V3UYB2B4.jpg",
      "Instrucciones": "Ingredientes:  500 g de carne de ternera picada 2 cebollas grandes, picadas finamente 3 cucharadas de grasa de cerdo (puedes sustituirla por aceite vegetal) 3 cucharadas de pimentón dulce 1 cucharada de comino molido Sal al gusto Pimienta al gusto Aceitunas verdes, sin hueso, cortadas en rodajas (opcional) Pasas de uva (opcional) 1 taza de agua caliente (aproximadamente) Para la masa:  500 g de harina de trigo 100 g de grasa de cerdo derretida (puedes sustituirla por manteca de cerdo o margarina) 1 cucharadita de sal Agua tibia (aproximadamente 250 ml) Instrucciones:  En una sartén grande, calienta la grasa de cerdo (o aceite vegetal) a fuego medio. Agrega las cebollas picadas y cocínalas hasta que estén transparentes.  Agrega la carne picada a la sartén y cocina hasta que esté dorada y cocida por completo. Remueve constantemente para deshacer los grumos de carne.  Añade el pimentón dulce, el comino, la sal y la pimienta. Mezcla bien todos los ingredientes y cocina por unos minutos más.  Si deseas, puedes agregar aceitunas cortadas en rodajas y pasas de uva a la mezcla de carne. Esto es opcional y depende de tu preferencia.  Agrega el agua caliente a la mezcla de carne y cocina a fuego bajo durante unos 20-30 minutos, o hasta que se haya evaporado el líquido y la carne esté bien condimentada.  Mientras tanto, prepara la masa para las empanadas. En un recipiente grande, mezcla la harina y la sal. Añade la grasa de cerdo derretida y mezcla bien.  Agrega poco a poco agua tibia mientras amasas la masa, hasta obtener una consistencia suave y elástica. Si es necesario, añade más agua o harina para ajustar la textura de la masa.  Divide la masa en porciones y forma bolas del tamaño deseado para las empanadas.  Estira cada bola de masa con un rodillo hasta obtener círculos delgados de aproximadamente 15 cm de diámetro.  Coloca una porción de relleno de carne en el centro de cada círculo de masa. Dobla la masa por la mitad, formando una media luna, y presiona los bordes para sellarlas. Puedes utilizar un tenedor para hacer un patrón decorativo en los bordes.  Precalienta el horno a 180°C.  Coloca las empanadas en una bandeja de horno ligeramente engrasada, dejando un poco de espacio entre ellas.  Hornea las empanadas durante aproximadamente 20-25 minutos, o hasta que estén doradas y crujientes.  ¡Retira del horno y sirve las empanadas tucumanas calientes! Puedes acompañarlas con una salsa picante o disfrutarlas solas.",
      "id": 1
    },
    {
      "nombreReceta": "Milanesa con Pure",
      "imagen": "https://www.indega.com.py/primicia/wp-content/uploads/2022/04/pure-de-papa-con-pollo-broaster-large-qlJiPE4lyS.jpeg",
      "Instrucciones": "Aquí tienes una receta clásica de milanesa con puré, un plato tradicional y delicioso:  Ingredientes:  Para las milanesas:  4 filetes de carne (puedes usar carne de ternera, pollo o cerdo) Sal al gusto Pimienta al gusto 1 taza de pan rallado 1 taza de harina de trigo 2 huevos batidos Aceite vegetal para freír Para el puré:  4 papas grandes, peladas y cortadas en cubos 2 cucharadas de mantequilla 1/4 taza de leche caliente Sal al gusto Pimienta al gusto Instrucciones:  Prepara los filetes de carne, asegurándote de que estén limpios y sin exceso de grasa. Golpéalos ligeramente con un mazo de carne para ablandarlos. Sazona ambos lados de los filetes con sal y pimienta al gusto.  Prepara tres platos o recipientes poco profundos. En el primer plato, coloca la harina de trigo. En el segundo plato, coloca los huevos batidos. En el tercer plato, coloca el pan rallado.  Pasa cada filete de carne por la harina, asegurándote de cubrirlo completamente. Luego, sumérgelo en los huevos batidos y finalmente, pásalo por el pan rallado, presionando suavemente para que se adhiera bien.  Calienta suficiente aceite vegetal en una sartén grande a fuego medio-alto. Cuando el aceite esté caliente, coloca las milanesas cuidadosamente en la sartén y fríelas por ambos lados hasta que estén doradas y crujientes. Esto tomará aproximadamente 4-5 minutos por cada lado, dependiendo del grosor de las milanesas y del tipo de carne que estés utilizando.  Una vez que las milanesas estén doradas, retíralas de la sartén y colócalas sobre papel absorbente para eliminar el exceso de aceite.  Mientras tanto, prepara el puré de papas. Hierve las papas en agua con sal hasta que estén tiernas. Luego, escúrrelas y colócalas en un tazón grande.  Agrega la mantequilla a las papas calientes y comienza a aplastarlas con un tenedor o un pasapurés hasta obtener una consistencia suave. Gradualmente, agrega la leche caliente mientras sigues mezclando hasta obtener un puré cremoso. Ajusta la cantidad de leche según la consistencia deseada. Sazona con sal y pimienta al gusto.  Sirve las milanesas calientes junto con el puré de papas. Puedes agregar una rodaja de limón y acompañar con ensalada fresca si lo deseas.  ¡Disfruta de este clásico plato argentino de milanesa con puré!",
      "id": 2
    },
    {
      "nombreReceta": "Flan de chocolate",
      "imagen": "https://t2.uc.ltmcdn.com/es/posts/1/4/5/como_hacer_flan_de_chocolate_23541_600_square.jpg",
      "Instrucciones": "Aquí tienes una deliciosa receta de flan de chocolate argentino:  Ingredientes:  1 lata de leche condensada (397 g) 1 lata de leche evaporada (370 ml) 4 huevos 100 g de chocolate negro (preferiblemente con al menos 70% de cacao) 1 cucharadita de esencia de vainilla Caramelo líquido para el molde (puedes comprarlo listo o hacerlo casero con azúcar) Instrucciones:  Precalienta el horno a 180°C.  En una olla pequeña a fuego medio-bajo, derrite el chocolate negro hasta que esté completamente derretido. Remueve constantemente para evitar que se queme. Una vez derretido, retira del fuego y reserva.  En un tazón grande, mezcla la leche condensada, la leche evaporada, los huevos y la esencia de vainilla. Bate bien hasta obtener una mezcla homogénea.  Agrega el chocolate derretido a la mezcla y continúa batiendo hasta que esté bien incorporado.  En un molde para flan, vierte el caramelo líquido y asegúrate de cubrir completamente el fondo y los lados del molde.  Vierte la mezcla de flan de chocolate en el molde caramelizado.  Coloca el molde dentro de una bandeja para horno más grande y llénala con agua caliente hasta que alcance aproximadamente la mitad de la altura del molde para flan. Esto creará un baño maría.  Cubre el molde para flan con papel de aluminio.  Coloca la bandeja con el molde dentro del horno precalentado y hornea durante aproximadamente 60-70 minutos, o hasta que el flan esté firme en los bordes pero aún ligeramente tembloroso en el centro.  Retira el flan del horno y deja que se enfríe a temperatura ambiente. Luego, refrigéralo durante al menos 4 horas o preferiblemente durante toda la noche para que se asiente bien.  Para desmoldar el flan, pasa un cuchillo por los bordes del molde para ayudar a que se despegue. Coloca un plato boca abajo sobre el molde y dale la vuelta rápidamente. El flan debería desprenderse del molde y caer sobre el plato con el caramelo líquido en la parte superior.  Sirve el flan de chocolate argentino frío y disfrútalo como postre.  ¡Disfruta de este rico y cremoso flan de chocolate argentino!",
      "id": 3
    },
    {
      "nombreReceta": "Chocolatada Deliciosa",
      "imagen": "https://s3.amazonaws.com/arc-wordpress-client-uploads/infobae-wp/wp-content/uploads/2017/06/18172916/leche-con-chocolate.jpg",
      "Instrucciones": "Aquí tienes una receta simple para preparar una deliciosa chocolatada:  Ingredientes:  2 tazas de leche (entera o la variedad de tu preferencia) 2 cucharadas de cacao en polvo sin azúcar 2 cucharadas de azúcar (opcional, ajusta la cantidad según tu gusto) 1/2 cucharadita de esencia de vainilla (opcional) Instrucciones:  Vierte la leche en una olla pequeña y caliéntala a fuego medio-bajo. No dejes que hierva, solo necesitas calentarla.  Agrega el cacao en polvo y el azúcar a la leche caliente. Si prefieres una chocolatada más dulce, puedes agregar más azúcar según tu gusto personal.  Con un batidor de mano, bate vigorosamente la mezcla de leche, cacao y azúcar hasta que estén bien incorporados y no queden grumos. Si lo prefieres, también puedes usar un batidor de globo o una licuadora para mezclar los ingredientes.  Si deseas darle un toque de sabor extra, añade la esencia de vainilla y mezcla nuevamente.  Vuelve a calentar la mezcla a fuego medio-bajo hasta que esté caliente y lista para servir. Asegúrate de remover constantemente mientras se calienta para evitar que se pegue al fondo de la olla y para asegurarte de que todos los ingredientes estén bien incorporados.  Una vez que la chocolatada esté caliente, retírala del fuego y sírvela en tazas o vasos.  Puedes disfrutar tu chocolatada tal como está, o también puedes añadirle un poco de crema batida o malvaviscos por encima para darle un toque especial. ¡Disfruta de tu deliciosa chocolatada casera!",
      "id": 5
    }
  ],
  "usuarios": [
    {
      "id": 1,
      "nombreUsuario": "admin",
      "email": "adim@gmail.com",
      "contra": "Yjp6g3g3"
    },
    {
      "nombreUsuario": "agustin",
      "email": "agus@gmail.com",
      "contra": "Agus1234",
      "id": 2
    },
    {
      "nombreUsuario": "AgustinComics",
      "email": "comic@gmail.com",
      "contra": "Comics12",
      "id": 3
    },
    {
      "nombreUsuario": "Prueba",
      "email": "prueba@gmail.com",
      "contra": "Prueba12",
      "id": 4
    }
  ],
  "profile": {
    "name": "typicode"
  }
}